two-7/openCAN/boards.txt
# openCAN SAMD21 Boards
# --------------------------------------
opencan.name=openCAN

opencan.vid.0=0x0909
opencan.pid.0=0x2727
opencan.upload_port.0.vid=0x0909
opencan.upload_port.0.pid=0x2727
opencan.upload_port.0.board=opencan

opencan.upload.tool=bossac
opencan.upload.tool.default=bossac
opencan.upload.tool.network=arduino_ota
opencan.upload.protocol=sam-ba
opencan.upload.maximum_size=262144
opencan.upload.maximum_data_size=32768
opencan.upload.use_1200bps_touch=true
opencan.upload.wait_for_upload_port=true
opencan.upload.native_usb=true

opencan.bootloader.tool=openocd
opencan.bootloader.tool.default=openocd
opencan.bootloader.file=openCAN/openCAN_ba.bin

opencan.build.mcu=cortex-m0plus
opencan.build.f_cpu=48000000L
opencan.build.usb_product="openCAN"
opencan.build.usb_manufacturer="two-7"
opencan.build.board=TWO7_OPENCAN
opencan.build.core=openCAN
opencan.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
opencan.build.openocdscript=openocd_scripts/openCAN.cfg
opencan.build.variant=openCAN
opencan.build.variant_system_lib=
opencan.build.vid=0x0909
opencan.build.pid=0x2727
opencan.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags} -DDEVICE_OPENCAN

# RAUSWORKS VIM (Monitor Only)
# --------------------------------------
vim_monitor.name=RAUSWORKS VIM (Monitor Only)

vim_monitor.vid.0=0x0909
vim_monitor.pid.0=0x0027
vim_monitor.upload_port.0.vid=0x0909
vim_monitor.upload_port.0.pid=0x0027
vim_monitor.upload_port.0.board=vim_monitor

vim_monitor.upload.tool=none
vim_monitor.upload.protocol=none
vim_monitor.upload.maximum_size=0

vim_monitor.build.mcu=cortex-m0plus
vim_monitor.build.f_cpu=48000000L
vim_monitor.build.usb_product="VIM"
vim_monitor.build.usb_manufacturer="two-7"
vim_monitor.build.board=TWO7_VIM
vim_monitor.build.core=openCAN
vim_monitor.build.variant=openCAN
vim_monitor.build.vid=0x0909
vim_monitor.build.pid=0x0027
vim_monitor.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags} -DDEVICE_VIM
